AoLaD/rtems/c/src/lib/libbsp/arm/tms570/include/tms570ls3135zwt-pins.h
#define TMS570_BALL_E6 TMS570_BALL_WITH_MMR(22, 3)
#define TMS570_BALL_E6_ETMDATA_11 TMS570_PIN_AND_FNC(TMS570_BALL_E6, 0)
#define TMS570_BALL_E6_EMIF_ADDR_2 TMS570_PIN_AND_FNC(TMS570_BALL_E6, 1)

#define TMS570_BALL_C6 TMS570_BALL_WITH_MMR(23, 0)
#define TMS570_BALL_C6_EMIF_ADDR_8 TMS570_PIN_AND_FNC(TMS570_BALL_C6, 0)
#define TMS570_BALL_C6_RTP_DATA_11 TMS570_PIN_AND_FNC(TMS570_BALL_C6, 1)
#define TMS570_BALL_C6_HET2_15 TMS570_PIN_AND_FNC(TMS570_BALL_C6, 2)

#define TMS570_MMR_SELECT_SPI4CLK TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(23, 1), 0)

#define TMS570_MMR_SELECT_SPI4SIMO TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(23, 2), 0)

#define TMS570_MMR_SELECT_SPI4SOMI TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(23, 3), 0)

#define TMS570_MMR_SELECT_SPI4NENA TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(24, 0), 0)

#define TMS570_MMR_SELECT_SPI4NCS_0 TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(24, 1), 0)

#define TMS570_BALL_A13 TMS570_BALL_WITH_MMR(24, 2)
#define TMS570_BALL_A13_HET1_17 TMS570_PIN_AND_FNC(TMS570_BALL_A13, 0)

#define TMS570_BALL_B13 TMS570_BALL_WITH_MMR(24, 3)
#define TMS570_BALL_B13_HET1_19 TMS570_PIN_AND_FNC(TMS570_BALL_B13, 0)

#define TMS570_BALL_H4 TMS570_BALL_WITH_MMR(25, 0)
#define TMS570_BALL_H4_HET1_21 TMS570_PIN_AND_FNC(TMS570_BALL_H4, 0)

#define TMS570_BALL_J4 TMS570_BALL_WITH_MMR(25, 1)
#define TMS570_BALL_J4_HET1_23 TMS570_PIN_AND_FNC(TMS570_BALL_J4, 0)

#define TMS570_BALL_M3 TMS570_BALL_WITH_MMR(25, 2)
#define TMS570_BALL_M3_HET1_25 TMS570_PIN_AND_FNC(TMS570_BALL_M3, 0)

#define TMS570_BALL_A9 TMS570_BALL_WITH_MMR(25, 3)
#define TMS570_BALL_A9_HET1_27 TMS570_PIN_AND_FNC(TMS570_BALL_A9, 0)

#define TMS570_BALL_A3 TMS570_BALL_WITH_MMR(26, 0)
#define TMS570_BALL_A3_HET1_29 TMS570_PIN_AND_FNC(TMS570_BALL_A3, 0)

#define TMS570_BALL_J17 TMS570_BALL_WITH_MMR(26, 1)
#define TMS570_BALL_J17_HET1_31 TMS570_PIN_AND_FNC(TMS570_BALL_J17, 0)

#define TMS570_BALL_W6 TMS570_BALL_WITH_MMR(26, 2)
#define TMS570_BALL_W6_MIBSPI5NCS_2 TMS570_PIN_AND_FNC(TMS570_BALL_W6, 0)
#define TMS570_BALL_W6_DMM_DATA_2 TMS570_PIN_AND_FNC(TMS570_BALL_W6, 1)

#define TMS570_BALL_T12 TMS570_BALL_WITH_MMR(26, 3)
#define TMS570_BALL_T12_MIBSPI5NCS_3 TMS570_PIN_AND_FNC(TMS570_BALL_T12, 0)
#define TMS570_BALL_T12_DMM_DATA_3 TMS570_PIN_AND_FNC(TMS570_BALL_T12, 1)

#define TMS570_BALL_E19 TMS570_BALL_WITH_MMR(27, 0)
#define TMS570_BALL_E19_MIBSPI5NCS_0 TMS570_PIN_AND_FNC(TMS570_BALL_E19, 0)
#define TMS570_BALL_E19_DMM_DATA_5 TMS570_PIN_AND_FNC(TMS570_BALL_E19, 1)

#define TMS570_BALL_B6 TMS570_BALL_WITH_MMR(27, 1)
#define TMS570_BALL_B6_MIBSPI5NCS_1 TMS570_PIN_AND_FNC(TMS570_BALL_B6, 0)
#define TMS570_BALL_B6_DMM_DATA_6 TMS570_PIN_AND_FNC(TMS570_BALL_B6, 1)

#define TMS570_BALL_E16 TMS570_BALL_WITH_MMR(27, 2)
#define TMS570_BALL_E16_MIBSPI5SIMO_1 TMS570_PIN_AND_FNC(TMS570_BALL_E16, 0)
#define TMS570_BALL_E16_DMM_DATA_9 TMS570_PIN_AND_FNC(TMS570_BALL_E16, 1)

#define TMS570_BALL_H17 TMS570_BALL_WITH_MMR(27, 3)
#define TMS570_BALL_H17_MIBSPI5SIMO_2 TMS570_PIN_AND_FNC(TMS570_BALL_H17, 0)
#define TMS570_BALL_H17_DMM_DATA_10 TMS570_PIN_AND_FNC(TMS570_BALL_H17, 1)

#define TMS570_BALL_G17 TMS570_BALL_WITH_MMR(28, 0)
#define TMS570_BALL_G17_MIBSPI5SIMO_3 TMS570_PIN_AND_FNC(TMS570_BALL_G17, 0)
#define TMS570_BALL_G17_DMM_DATA_11 TMS570_PIN_AND_FNC(TMS570_BALL_G17, 1)

#define TMS570_BALL_E17 TMS570_BALL_WITH_MMR(28, 1)
#define TMS570_BALL_E17_MIBSPI5SOMI_1 TMS570_PIN_AND_FNC(TMS570_BALL_E17, 0)
#define TMS570_BALL_E17_DMM_DATA_13 TMS570_PIN_AND_FNC(TMS570_BALL_E17, 1)

#define TMS570_BALL_H16 TMS570_BALL_WITH_MMR(28, 2)
#define TMS570_BALL_H16_MIBSPI5SOMI_2 TMS570_PIN_AND_FNC(TMS570_BALL_H16, 0)
#define TMS570_BALL_H16_DMM_DATA_14 TMS570_PIN_AND_FNC(TMS570_BALL_H16, 1)

#define TMS570_BALL_G16 TMS570_BALL_WITH_MMR(28, 3)
#define TMS570_BALL_G16_MIBSPI5SOMI_3 TMS570_PIN_AND_FNC(TMS570_BALL_G16, 0)
#define TMS570_BALL_G16_DMM_DATA_15 TMS570_PIN_AND_FNC(TMS570_BALL_G16, 1)

#define TMS570_BALL_D3 TMS570_BALL_WITH_MMR(29, 0)
#define TMS570_BALL_D3_SPI2NENA TMS570_PIN_AND_FNC(TMS570_BALL_D3, 0)
#define TMS570_BALL_D3_SPI2NCS_1 TMS570_PIN_AND_FNC(TMS570_BALL_D3, 1)

#define TMS570_MMR_SELECT_EMIF_CLK_SEL TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(29, 1), 0)

#define TMS570_BALL_F2 TMS570_BALL_WITH_MMR(29, 2)
#define TMS570_BALL_F2_GIOB_2 TMS570_PIN_AND_FNC(TMS570_BALL_F2, 0)

#define TMS570_MMR_SELECT_GMII_SEL TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(29, 3), 0)

#define TMS570_MMR_SELECT_ADC_TRG1 TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(30, 0), 0)
#define TMS570_MMR_SELECT_ADC_TRG2 TMS570_PIN_AND_FNC(TMS570_BALL_WITH_MMR(30, 0), 1)

/* Default pinmux select */

#define TMS570_PINMMR_DEFAULT_INIT_LIST(per_pin_action, common_arg) \
  per_pin_action(common_arg, TMS570_BALL_W10_GIOB_3) \
  per_pin_action(common_arg, TMS570_BALL_A5_GIOA_0) \
  per_pin_action(common_arg, TMS570_BALL_C3_MIBSPI3NCS_3) \
  per_pin_action(common_arg, TMS570_BALL_B2_MIBSPI3NCS_2) \
  per_pin_action(common_arg, TMS570_BALL_C2_GIOA_1) \
  per_pin_action(common_arg, TMS570_BALL_E3_HET1_11) \
  per_pin_action(common_arg, TMS570_BALL_E5_ETMDATA_20) \
  per_pin_action(common_arg, TMS570_BALL_F5_ETMDATA_21) \
  per_pin_action(common_arg, TMS570_BALL_C1_GIOA_2) \
  per_pin_action(common_arg, TMS570_BALL_G5_ETMDATA_22) \
  per_pin_action(common_arg, TMS570_BALL_E1_GIOA_3) \
  per_pin_action(common_arg, TMS570_BALL_B5_GIOA_5) \
  per_pin_action(common_arg, TMS570_BALL_K5_ETMDATA_23) \
  per_pin_action(common_arg, TMS570_BALL_B3_HET1_22) \
  per_pin_action(common_arg, TMS570_BALL_H3_GIOA_6) \
  per_pin_action(common_arg, TMS570_BALL_L5_ETMDATA_24) \
  per_pin_action(common_arg, TMS570_BALL_M1_GIOA_7) \
  per_pin_action(common_arg, TMS570_BALL_M5_ETMDATA_25) \
  per_pin_action(common_arg, TMS570_BALL_V2_HET1_01) \
  per_pin_action(common_arg, TMS570_BALL_U1_HET1_03) \
  per_pin_action(common_arg, TMS570_BALL_K18_HET1_00) \
  per_pin_action(common_arg, TMS570_BALL_W5_HET1_02) \
  per_pin_action(common_arg, TMS570_BALL_V6_HET1_05) \
  per_pin_action(common_arg, TMS570_BALL_N5_ETMDATA_26) \
  per_pin_action(common_arg, TMS570_BALL_T1_HET1_07) \
  per_pin_action(common_arg, TMS570_BALL_P5_ETMDATA_27) \
  per_pin_action(common_arg, TMS570_BALL_V7_HET1_09) \
  per_pin_action(common_arg, TMS570_BALL_R5_ETMDATA_28) \
  per_pin_action(common_arg, TMS570_BALL_R6_ETMDATA_29) \
  per_pin_action(common_arg, TMS570_BALL_V5_MIBSPI3NCS_1) \
  per_pin_action(common_arg, TMS570_BALL_W3_HET1_06) \
  per_pin_action(common_arg, TMS570_BALL_R7_ETMDATA_30) \
  per_pin_action(common_arg, TMS570_BALL_N2_HET1_13) \
  per_pin_action(common_arg, TMS570_BALL_G3_MIBSPI1NCS_2) \
  per_pin_action(common_arg, TMS570_BALL_N1_HET1_15) \
  per_pin_action(common_arg, TMS570_BALL_R8_ETMDATA_31) \
  per_pin_action(common_arg, TMS570_BALL_R9_ETMTRACECLKIN) \
  per_pin_action(common_arg, TMS570_BALL_W9_MIBSPI3NENA) \
  per_pin_action(common_arg, TMS570_BALL_V10_MIBSPI3NCS_0) \
  per_pin_action(common_arg, TMS570_BALL_J3_MIBSPI1NCS_3) \
  per_pin_action(common_arg, TMS570_BALL_N19_AD1EVT) \
  per_pin_action(common_arg, TMS570_BALL_N15_ETMDATA_19) \
  per_pin_action(common_arg, TMS570_BALL_N17_EMIF_nCS_0) \
  per_pin_action(common_arg, TMS570_BALL_M15_ETMDATA_18) \
  per_pin_action(common_arg, TMS570_BALL_K17_EMIF_nCS_3) \
  per_pin_action(common_arg, TMS570_BALL_M17_EMIF_nCS_4) \
  per_pin_action(common_arg, TMS570_BALL_L15_ETMDATA_17) \
  per_pin_action(common_arg, TMS570_BALL_P1_HET1_24) \
  per_pin_action(common_arg, TMS570_BALL_A14_HET1_26) \
  per_pin_action(common_arg, TMS570_BALL_K15_ETMDATA_16) \
  per_pin_action(common_arg, TMS570_BALL_G19_MIBSPI1NENA) \
  per_pin_action(common_arg, TMS570_BALL_H18_MIBSPI5NENA) \
  per_pin_action(common_arg, TMS570_BALL_J18_MIBSPI5SOMI_0) \
  per_pin_action(common_arg, TMS570_BALL_J19_MIBSPI5SIMO_0) \
  per_pin_action(common_arg, TMS570_BALL_H19_MIBSPI5CLK) \
  per_pin_action(common_arg, TMS570_BALL_R2_MIBSPI1NCS_0) \
  per_pin_action(common_arg, TMS570_BALL_E18_HET1_08) \
  per_pin_action(common_arg, TMS570_BALL_K19_HET1_28) \
  per_pin_action(common_arg, TMS570_BALL_D17_EMIF_nWE) \
  per_pin_action(common_arg, TMS570_BALL_D16_EMIF_BA_1) \
  per_pin_action(common_arg, TMS570_BALL_C17_EMIF_ADDR_21) \
  per_pin_action(common_arg, TMS570_BALL_C16_EMIF_ADDR_20) \
  per_pin_action(common_arg, TMS570_BALL_C15_EMIF_ADDR_19) \
  per_pin_action(common_arg, TMS570_BALL_D15_EMIF_ADDR_18) \
  per_pin_action(common_arg, TMS570_BALL_E13_ETMDATA_12) \
  per_pin_action(common_arg, TMS570_BALL_C14_EMIF_ADDR_17) \
  per_pin_action(common_arg, TMS570_BALL_D14_EMIF_ADDR_16) \
  per_pin_action(common_arg, TMS570_BALL_E12_ETMDATA_13) \
  per_pin_action(common_arg, TMS570_BALL_D19_HET1_10) \
  per_pin_action(common_arg, TMS570_BALL_E11_ETMDATA_14) \
  per_pin_action(common_arg, TMS570_BALL_B4_HET1_12) \
  per_pin_action(common_arg, TMS570_BALL_E9_ETMDATA_8) \
  per_pin_action(common_arg, TMS570_BALL_C13_EMIF_ADDR_15) \
  per_pin_action(common_arg, TMS570_BALL_A11_HET1_14) \
  per_pin_action(common_arg, TMS570_BALL_C12_EMIF_ADDR_14) \
  per_pin_action(common_arg, TMS570_BALL_M2_GIOB_0) \
  per_pin_action(common_arg, TMS570_BALL_E8_ETMDATA_09) \
  per_pin_action(common_arg, TMS570_BALL_B11_HET1_30) \
  per_pin_action(common_arg, TMS570_BALL_E10_ETMDATA_15) \
  per_pin_action(common_arg, TMS570_BALL_E7_ETMDATA_10) \
  per_pin_action(common_arg, TMS570_BALL_C11_EMIF_ADDR_13) \
  per_pin_action(common_arg, TMS570_BALL_C10_EMIF_ADDR_12) \
  per_pin_action(common_arg, TMS570_BALL_F3_MIBSPI1NCS_1) \
  per_pin_action(common_arg, TMS570_BALL_C9_EMIF_ADDR_11) \
  per_pin_action(common_arg, TMS570_BALL_D5_EMIF_ADDR_1) \
  per_pin_action(common_arg, TMS570_BALL_K2_GIOB_1) \
  per_pin_action(common_arg, TMS570_BALL_C8_EMIF_ADDR_10) \
  per_pin_action(common_arg, TMS570_BALL_C7_EMIF_ADDR_9) \
  per_pin_action(common_arg, TMS570_BALL_D4_EMIF_ADDR_0) \
  per_pin_action(common_arg, TMS570_BALL_C5_EMIF_ADDR_7) \
  per_pin_action(common_arg, TMS570_BALL_C4_EMIF_ADDR_6) \
  per_pin_action(common_arg, TMS570_BALL_E6_ETMDATA_11) \
  per_pin_action(common_arg, TMS570_BALL_C6_EMIF_ADDR_8) \
  per_pin_action(common_arg, TMS570_MMR_SELECT_SPI4CLK) \
  per_pin_action(common_arg, TMS570_MMR_SELECT_SPI4SIMO) \
  per_pin_action(common_arg, TMS570_MMR_SELECT_SPI4SOMI) \
  per_pin_action(common_arg, TMS570_MMR_SELECT_SPI4NENA) \
  per_pin_action(common_arg, TMS570_MMR_SELECT_SPI4NCS_0) \
  per_pin_action(common_arg, TMS570_BALL_A13_HET1_17) \
  per_pin_action(common_arg, TMS570_BALL_B13_HET1_19) \
  per_pin_action(common_arg, TMS570_BALL_H4_HET1_21) \
  per_pin_action(common_arg, TMS570_BALL_J4_HET1_23) \
  per_pin_action(common_arg, TMS570_BALL_M3_HET1_25) \
  per_pin_action(common_arg, TMS570_BALL_A9_HET1_27) \
  per_pin_action(common_arg, TMS570_BALL_A3_HET1_29) \
  per_pin_action(common_arg, TMS570_BALL_J17_HET1_31) \
  per_pin_action(common_arg, TMS570_BALL_W6_MIBSPI5NCS_2) \
  per_pin_action(common_arg, TMS570_BALL_T12_MIBSPI5NCS_3) \
  per_pin_action(common_arg, TMS570_BALL_E19_MIBSPI5NCS_0) \
  per_pin_action(common_arg, TMS570_BALL_B6_MIBSPI5NCS_1) \
  per_pin_action(common_arg, TMS570_BALL_E16_MIBSPI5SIMO_1) \
  per_pin_action(common_arg, TMS570_BALL_H17_MIBSPI5SIMO_2) \
  per_pin_action(common_arg, TMS570_BALL_G17_MIBSPI5SIMO_3) \
  per_pin_action(common_arg, TMS570_BALL_E17_MIBSPI5SOMI_1) \
  per_pin_action(common_arg, TMS570_BALL_H16_MIBSPI5SOMI_2) \
  per_pin_action(common_arg, TMS570_BALL_G16_MIBSPI5SOMI_3) \
  per_pin_action(common_arg, TMS570_BALL_D3_SPI2NENA) \
  per_pin_action(common_arg, TMS570_MMR_SELECT_EMIF_CLK_SEL) \
  per_pin_action(common_arg, TMS570_BALL_F2_GIOB_2) \
  per_pin_action(common_arg, TMS570_MMR_SELECT_GMII_SEL) \
  per_pin_action(common_arg, TMS570_MMR_SELECT_ADC_TRG1) \

/* End of default PINMMR list */

#endif /*LIBBSP_ARM_TMS570_TMS570LS3135ZWT_PINS_H*/
